# core/Brewfile
# Baseline developer utilities (language-agnostic)

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Core CLI
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "tree"
brew "eza"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "watch"
brew "coreutils"

# Shell / prompt
brew "zsh"
brew "starship"
brew "fzf"
brew "tmux"

# Optional quality-of-life
brew "zoxide"

# Fonts
cask "font-jetbrains-mono"

# System Monitoring 
brew "htop"
brew "ncdu"
brew "btop"
